#### BuiltInFailures.RebarShapeFailures Members

---

|  |
| --- |
| BuiltInFailures RebarShapeFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RebarShapeFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CircleMultiPlanarShape | A circle can't be converted to multiplanar shape. |
| Public property Static member | CircleUnbounded | An unbounded circle can only be used to construct a spiral shape. |
| Public property Static member | CurveOverconstrained | Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension. |
| Public property Static member | CurvesCollinear | Collinear segments are not allowed in a Rebar Shape definition. |
| Public property Static member | CurvesUnlooped | Segments defining the Rebar Shape must be in a continuous loop. |
| Public property Static member | CurveUnderconstrained | Segment is underconstrained. It requires additional parameterized dimensions. |
| Public property Static member | DefaultParamaterValuesIncorrect | Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius). |
| Public property Static member | DepthDimensionNotExisted | Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth. |
| Public property Static member | DiagonalEdgesAreUnderconstrained | Shape is underconstrained. Please add additional dimension constraints to the shape's diagonal edges. (Diagonal segments with only one dimension constraint are automatically given a second constraint to lie at an angle of exactly 45 degrees, regardless of how they are drawn. The current shape has more than one such segment in sequence, and the resulting constrained edges are co-linear.) |
| Public property Static member | DimensionLoose | This dimension cannot be used to parameterize the Rebar Shape. |
| Public property Static member | DimensionWithCommonLengthUnit | A shape dimension is labelled with a parameter that uses the Common Length unit. |
| Public property Static member | DimensionWithoutParameter | Dimension has no parameter assigned to it. |
| Public property Static member | FormulaDrivenDimension | Dimension can't be driven by a formula parameter. |
| Public property Static member | HooksAndEndTreatmentAtTheSameEnd | Cannot add hooks and end treatments at the same end. |
| Public property Static member | MultiPlanarDepth | Multi-planar depth of Rebar Shape can't be too small. |
| Public property Static member | MultipleArcsMustOverlap | Multiple arcs are supported only if they are concentric and form a circle with an overlap. |
| Public property Static member | ParameterValueNotDefined | Parameter assigned to the dimension has no value defined. |
| Public property Static member | PlanarMultiPlanarShape | The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only. |
| Public property Static member | ShapeFailure | The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed. |
| Public property Static member | WrongDepthDimensionLabel | Multi-planar depth dimension label is already used for one of the planar shape parameters. |

# See Also

BuiltInFailures RebarShapeFailures Class

Autodesk.Revit.DB Namespace